### Stock Price predictions

In [56]:
import pandas as pd
import numpy as np

In [57]:
datas = pd.read_csv('data/NFLX.csv')

In [58]:
datas

,Date,Open,High,Low,Close,Adj Close,Volume
0,2018-02-05,262.000000,267.899994,250.029999,254.259995,254.259995,11896100
1,2018-02-06,247.699997,266.700012,245.000000,265.720001,265.720001,12595800
2,2018-02-07,266.579987,272.450012,264.329987,264.559998,264.559998,8981500
3,2018-02-08,267.079987,267.619995,250.000000,250.100006,250.100006,9306700
4,2018-02-09,253.850006,255.800003,236.110001,249.470001,249.470001,16906900
...,...,...,...,...,...,...,...
1004,2022-01-31,401.970001,427.700012,398.200012,427.140015,427.140015,20047500
1005,2022-02-01,432.959991,458.480011,425.540009,457.130005,457.130005,22542300
1006,2022-02-02,448.250000,451.980011,426.480011,429.480011,429.480011,14346000
1007,2022-02-03,421.440002,429.260010,404.279999,405.600006,405.600006,9905200
1008,2022-02-04,407.309998,412.769989,396.640015,410.170013,410.170013,7782400

In [59]:
datas['Date'] = pd.to_datetime(datas['Date'])
datas['year'] = datas['Date'].dt.year
datas['month'] = datas['Date'].dt.month
datas['day'] = datas['Date'].dt.day
datas.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume,year,month,day
0,2018-02-05,262.000000,267.899994,250.029999,254.259995,254.259995,11896100,2018,2,5
1,2018-02-06,247.699997,266.700012,245.000000,265.720001,265.720001,12595800,2018,2,6
2,2018-02-07,266.579987,272.450012,264.329987,264.559998,264.559998,8981500,2018,2,7

In [60]:
datas.drop('Date', axis=1, inplace=True)
datas.head(2)

,Open,High,Low,Close,Adj Close,Volume,year,month,day
0,262.000000,267.899994,250.029999,254.259995,254.259995,11896100,2018,2,5
1,247.699997,266.700012,245.000000,265.720001,265.720001,12595800,2018,2,6

In [61]:
datas.shape

(1009, 9)

In [62]:
datas.isnull().sum()

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
year         0
month        0
day          0
dtype: int64

In [63]:
datas.duplicated().sum()

np.int64(0)

In [64]:
datas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       1009 non-null   float64
 1   High       1009 non-null   float64
 2   Low        1009 non-null   float64
 3   Close      1009 non-null   float64
 4   Adj Close  1009 non-null   float64
 5   Volume     1009 non-null   int64
 6   year       1009 non-null   int32
 7   month      1009 non-null   int32
 8   day        1009 non-null   int32
dtypes: float64(5), int32(3), int64(1)
memory usage: 59.2 KB

In [65]:
datas.describe()

,Open,High,Low,Close,Adj Close,Volume,year,month,day
count,1009.000000,1009.000000,1009.000000,1009.000000,1009.000000,1.009000e+03,1009.000000,1009.000000,1009.000000
mean,419.059673,425.320703,412.374044,419.000733,419.000733,7.570685e+06,2019.595639,6.540139,15.717542
std,108.537532,109.262960,107.555867,108.289999,108.289999,5.465535e+06,1.155997,3.428207,8.759264
min,233.919998,250.649994,231.229996,233.880005,233.880005,1.144000e+06,2018.000000,1.000000,1.000000
25%,331.489990,336.299988,326.000000,331.619995,331.619995,4.091900e+06,2019.000000,4.000000,8.000000
50%,377.769989,383.010010,370.880005,378.670013,378.670013,5.934500e+06,2020.000000,7.000000,16.000000
75%,509.130005,515.630005,502.529999,509.079987,509.079987,9.322400e+06,2021.000000,10.000000,23.000000
max,692.349976,700.989990,686.090027,691.690002,691.690002,5.890430e+07,2022.000000,12.000000,31.000000

In [69]:
x = datas.drop("Close", axis=1)
y = datas['Close']
y.shape

(1009,)

In [ ]:
! pip install scikit-learn